load-test/campaigns/2026-08-09_projection-vs-snapshot/scenarios/mode-fixed-300.yml
# 고정 부하 라운드 — 300 arrivals/s (판정용). 사전 등록: ../README.md §5·§7
#
# 직전 캠페인의 scenarios/skeleton-cache-step-size10.yml을 본으로 삼되 **계단을 걷어냈다.**
# 이 캠페인이 재는 것은 knee의 위치가 아니라 **한 부하점에서의 요청당 앱 CPU 간극**이고,
# 계단형은 한 라운드 안에 부하가 여러 개라 라운드 전체의 cgroup 누계를 요청 수로 나눌 수 없다.
#
# 요청 믹스·태그 파라미터·size=10은 본으로 삼은 파일과 **한 글자도 다르지 않다** — 바뀌는 축은
# 부하 프로파일 하나여야 세 모드의 차이가 모드에만 귀속된다.
# size 10은 운영 기본값(PlaceService.DEFAULT_PAGE_SIZE)이다.
#
# 여섯 phase로 나눈 이유 (사전 등록 §7 "라운드마다 재생성"의 처방):
#   w1  30s  60    ─┐  직전 캠페인 계단 시나리오의 사다리를 그대로 쓴다. 30초 계단 다섯 칸으로
#   w2  30s  120    │  도착률을 목표까지 올리며 차가운 JVM을 태운다
#   w3  30s  180    │
#   w4  30s  240    │
#   w5  30s  300   ─┘  목표 부하에서 정상상태에 들어간다
#   measure 60s 300    판정 구간. Artillery 중간 리포트가 10초 버킷이라 온전한 버킷 5개가 떨어진다
# w1~w5는 전부 **측정에서 제외한다**.
#
# ⚠️ 사다리를 이렇게 잡은 근거는 폐기한 라운드 셋의 실측이다(results/execution-log.md).
#   1판 `20s 60→300 · 30s 300 · 60s 300` → 적체가 측정 구간 앞 2버킷까지 남았다(p50 3,395·1,901ms)
#   2·3판 `40s 120(고정) · 30s 120→300 · 30s 300 · 60s 300` → **w1의 120에서 이미 붕괴**했다.
#     entity의 차가운 요청당 앱 CPU가 **10.4ms**(더워진 뒤 3.04ms의 3.4배)라 도착 120(≈184 req/s)
#     만으로 1.9코어를 먹고, 여기에 GC와 호스트 경합이 얹히면 2 vCPU를 넘겨 큐가 발산한다.
#     한번 발산하면 요청당 CPU가 4.17ms로 굳고(더워진 값의 1.4배) 측정 구간이 붕괴 구간이 된다.
#   → 차가운 상한은 2 vCPU ÷ 10.4ms ÷ 1.6(요청/도착) ≈ **도착 120/s**로, 고정 시작점으로 쓸 수
#     없는 값이었다. 그래서 60에서 출발해 30초씩 올리는 직전 캠페인의 사다리로 되돌렸다 —
#     그 사다리는 같은 호스트에서 세 캠페인 동안 목표 부하까지 붕괴 없이 올라간 이력이 있다.
#
# 분석 스크립트(tools/round-analyze.py)가 이 phase 경계를 오프셋(0/30/60/90/120/150)으로 그대로
# 들고 있다. **phase 길이를 바꾸면 그 상수도 함께 바꿔야 한다.**
#
# phases는 단독 정의한다 — `environments`는 phase 배열을 원소 단위로 병합해 기본 프로파일이
# 잔존한다 (#381 측정 폐기 원인, load-test/README.md §5).
config:
  target: "http://localhost:8082"
  payload:
    path: "../../../data/users.csv"
    fields:
      - token
    order: random
    skipHeader: true
  # 커서에는 필터 지문이 박혀 있다 — 2페이지에서 태그가 달라지면 서버가 400으로 거절한다.
  # 그래서 태그는 요청마다가 아니라 시나리오 단위로 고정되는 config.variables로 뽑는다.
  variables:
    subA: [7, 8, 9, 10]             # OPTION1, parent = 1
    subB: [11, 12, 13, 14, 15, 16]  # OPTION2, parent = 1
  phases:
    - name: "w1-60"
      duration: 30
      arrivalRate: 60
    - name: "w2-120"
      duration: 30
      arrivalRate: 120
    - name: "w3-180"
      duration: 30
      arrivalRate: 180
    - name: "w4-240"
      duration: 30
      arrivalRate: 240
    - name: "w5-hold"
      duration: 30
      arrivalRate: 300
    - name: "measure"
      duration: 60
      arrivalRate: 300
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true

scenarios:
  # ── 무태그 ────────────────────────────────────────────────────────────────
  - name: "popular-town"
    weight: 25
    flow:
      - get:
          url: "/api/places"
          qs:
            townId: "{{ $randomNumber(301, 318) }}"
            isBookmarkSearch: false
            sort: "POPULAR"
            size: 10
          name: "popular-town-p1"
          headers:
            Authorization: "Bearer {{ token }}"

  - name: "latest-town"
    weight: 15
    flow:
      - get:
          url: "/api/places"
          qs:
            townId: "{{ $randomNumber(301, 318) }}"
            isBookmarkSearch: false
            sort: "LATEST"
            size: 10
          name: "latest-town-p1"
          headers:
            Authorization: "Bearer {{ token }}"

  - name: "popular-city-scroll"
    weight: 20
    flow:
      - get:
          url: "/api/places"
          qs:
            townId: 201
            isBookmarkSearch: false
            sort: "POPULAR"
            size: 10
          name: "popular-city-p1"
          headers:
            Authorization: "Bearer {{ token }}"
          capture:
            json: "$.data.nextCursor"
            as: "cursorPop"
      - get:
          url: "/api/places"
          qs:
            townId: 201
            isBookmarkSearch: false
            sort: "POPULAR"
            size: 10
            cursor: "{{ cursorPop }}"
          name: "popular-city-p2"
          headers:
            Authorization: "Bearer {{ token }}"
          ifTrue: "cursorPop"

  # ── 태그 필터 (b24185a 개선 대상 경로) ─────────────────────────────────────
  - name: "popular-city-tag3-scroll"
    weight: 25
    flow:
      - get:
          url: "/api/places"
          qs:
            townId: 201
            isBookmarkSearch: false
            sort: "POPULAR"
            mainTagId: 1
            subTagAIdList: "{{ subA }}"
            subTagBIdList: "{{ subB }}"
            size: 10
          name: "popular-city-tag3-p1"
          headers:
            Authorization: "Bearer {{ token }}"
          capture:
            json: "$.data.nextCursor"
            as: "cursorTagPop"
      - get:
          url: "/api/places"
          qs:
            townId: 201
            isBookmarkSearch: false
            sort: "POPULAR"
            mainTagId: 1
            subTagAIdList: "{{ subA }}"
            subTagBIdList: "{{ subB }}"
            size: 10
            cursor: "{{ cursorTagPop }}"
          name: "popular-city-tag3-p2"
          headers:
            Authorization: "Bearer {{ token }}"
          ifTrue: "cursorTagPop"

  - name: "latest-city-tag3-scroll"
    weight: 15
    flow:
      - get:
          url: "/api/places"
          qs:
            townId: 201
            isBookmarkSearch: false
            sort: "LATEST"
            mainTagId: 1
            subTagAIdList: "{{ subA }}"
            subTagBIdList: "{{ subB }}"
            size: 10
          name: "latest-city-tag3-p1"
          headers:
            Authorization: "Bearer {{ token }}"
          capture:
            json: "$.data.nextCursor"
            as: "cursorTagLat"
      - get:
          url: "/api/places"
          qs:
            townId: 201
            isBookmarkSearch: false
            sort: "LATEST"
            mainTagId: 1
            subTagAIdList: "{{ subA }}"
            subTagBIdList: "{{ subB }}"
            size: 10
            cursor: "{{ cursorTagLat }}"
          name: "latest-city-tag3-p2"
          headers:
            Authorization: "Bearer {{ token }}"
          ifTrue: "cursorTagLat"