load-test/campaigns/2026-08-09_projection-vs-snapshot/scenarios/mode-fixed-420.yml
# 고정 부하 라운드 — 420 arrivals/s (관찰용). 사전 등록: ../README.md §4 "부수 관찰"·§7
#
# 직전 캠페인의 scenarios/skeleton-cache-step-size10.yml을 본으로 삼되 **계단을 걷어냈다.**
# 이 캠페인이 재는 것은 knee의 위치가 아니라 **한 부하점에서의 요청당 앱 CPU 간극**이고,
# 계단형은 한 라운드 안에 부하가 여러 개라 라운드 전체의 cgroup 누계를 요청 수로 나눌 수 없다.
#
# 요청 믹스·태그 파라미터·size=10은 본으로 삼은 파일과 **한 글자도 다르지 않다** — 바뀌는 축은
# 부하 프로파일 하나여야 세 모드의 차이가 모드에만 귀속된다.
# size 10은 운영 기본값(PlaceService.DEFAULT_PAGE_SIZE)이다.
#
# 여섯 phase — **300 시나리오와 phase 경계(오프셋 0/30/60/90/120/150)가 완전히 같다.**
# 분석 스크립트를 공유하기 위한 것이고, 다른 것은 마지막 두 칸의 도착률뿐이다.
#   w1  30s  60 · w2  30s 120 · w3  30s 180 · w4  30s 300   차가운 JVM을 태우는 사다리
#   w5  30s  420                                            관찰 부하에 들어간다
#   measure 60s 420                                         관찰 구간
# w1~w5는 전부 **관찰에서 제외한다**. 사다리를 60에서 출발시키는 근거는 300 시나리오와 같다
# (폐기 라운드 셋의 실측 — results/execution-log.md).
#
# ⚠️ 이 부하점은 직전 캠페인에서 entity(=OFF)가 붕괴한 지점이다(스로틀 100%·p50 1,790ms·3/3 재현).
# 붕괴 라운드에서는 도착률 결손과 ETIMEDOUT이 정상이며, 그것 자체가 관찰 대상이다 —
# 300 라운드의 무효 조건(도착률 결손 2% 초과)을 이 라운드에 적용하지 않는다(사전 등록 §6은
# "300 구간"으로 한정한다).
#
# 분석 스크립트(tools/round-analyze.py)가 이 phase 경계를 오프셋(0/40/70/100, 길이 40/30/30/60)으로
# 그대로 들고 있다. **phase 길이를 바꾸면 그 상수도 함께 바꿔야 한다.**
#
# phases는 단독 정의한다 — `environments`는 phase 배열을 원소 단위로 병합해 기본 프로파일이
# 잔존한다 (#381 측정 폐기 원인, load-test/README.md §5).
config:
  target: "http://localhost:8082"
  payload:
    path: "../../../data/users.csv"
    fields:
      - token
    order: random
    skipHeader: true
  # 커서에는 필터 지문이 박혀 있다 — 2페이지에서 태그가 달라지면 서버가 400으로 거절한다.
  # 그래서 태그는 요청마다가 아니라 시나리오 단위로 고정되는 config.variables로 뽑는다.
  variables:
    subA: [7, 8, 9, 10]             # OPTION1, parent = 1
    subB: [11, 12, 13, 14, 15, 16]  # OPTION2, parent = 1
  phases:
    - name: "w1-60"
      duration: 30
      arrivalRate: 60
    - name: "w2-120"
      duration: 30
      arrivalRate: 120
    - name: "w3-180"
      duration: 30
      arrivalRate: 180
    - name: "w4-300"
      duration: 30
      arrivalRate: 300
    - name: "w5-hold"
      duration: 30
      arrivalRate: 420
    - name: "measure"
      duration: 60
      arrivalRate: 420
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true

scenarios:
  # ── 무태그 ────────────────────────────────────────────────────────────────
  - name: "popular-town"
    weight: 25
    flow:
      - get:
          url: "/api/places"
          qs:
            townId: "{{ $randomNumber(301, 318) }}"
            isBookmarkSearch: false
            sort: "POPULAR"
            size: 10
          name: "popular-town-p1"
          headers:
            Authorization: "Bearer {{ token }}"

  - name: "latest-town"
    weight: 15
    flow:
      - get:
          url: "/api/places"
          qs:
            townId: "{{ $randomNumber(301, 318) }}"
            isBookmarkSearch: false
            sort: "LATEST"
            size: 10
          name: "latest-town-p1"
          headers:
            Authorization: "Bearer {{ token }}"

  - name: "popular-city-scroll"
    weight: 20
    flow:
      - get:
          url: "/api/places"
          qs:
            townId: 201
            isBookmarkSearch: false
            sort: "POPULAR"
            size: 10
          name: "popular-city-p1"
          headers:
            Authorization: "Bearer {{ token }}"
          capture:
            json: "$.data.nextCursor"
            as: "cursorPop"
      - get:
          url: "/api/places"
          qs:
            townId: 201
            isBookmarkSearch: false
            sort: "POPULAR"
            size: 10
            cursor: "{{ cursorPop }}"
          name: "popular-city-p2"
          headers:
            Authorization: "Bearer {{ token }}"
          ifTrue: "cursorPop"

  # ── 태그 필터 (b24185a 개선 대상 경로) ─────────────────────────────────────
  - name: "popular-city-tag3-scroll"
    weight: 25
    flow:
      - get:
          url: "/api/places"
          qs:
            townId: 201
            isBookmarkSearch: false
            sort: "POPULAR"
            mainTagId: 1
            subTagAIdList: "{{ subA }}"
            subTagBIdList: "{{ subB }}"
            size: 10
          name: "popular-city-tag3-p1"
          headers:
            Authorization: "Bearer {{ token }}"
          capture:
            json: "$.data.nextCursor"
            as: "cursorTagPop"
      - get:
          url: "/api/places"
          qs:
            townId: 201
            isBookmarkSearch: false
            sort: "POPULAR"
            mainTagId: 1
            subTagAIdList: "{{ subA }}"
            subTagBIdList: "{{ subB }}"
            size: 10
            cursor: "{{ cursorTagPop }}"
          name: "popular-city-tag3-p2"
          headers:
            Authorization: "Bearer {{ token }}"
          ifTrue: "cursorTagPop"

  - name: "latest-city-tag3-scroll"
    weight: 15
    flow:
      - get:
          url: "/api/places"
          qs:
            townId: 201
            isBookmarkSearch: false
            sort: "LATEST"
            mainTagId: 1
            subTagAIdList: "{{ subA }}"
            subTagBIdList: "{{ subB }}"
            size: 10
          name: "latest-city-tag3-p1"
          headers:
            Authorization: "Bearer {{ token }}"
          capture:
            json: "$.data.nextCursor"
            as: "cursorTagLat"
      - get:
          url: "/api/places"
          qs:
            townId: 201
            isBookmarkSearch: false
            sort: "LATEST"
            mainTagId: 1
            subTagAIdList: "{{ subA }}"
            subTagBIdList: "{{ subB }}"
            size: 10
            cursor: "{{ cursorTagLat }}"
          name: "latest-city-tag3-p2"
          headers:
            Authorization: "Bearer {{ token }}"
          ifTrue: "cursorTagLat"